src/mp_toir/Documents/мп_ЗаданиеНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>мп_ЗаданиеНаРемонт</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаРемонт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаказНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_ИсточникиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнениеОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоказателяИзмерения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мп_ВидыПроверокОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмеренияПроверкиВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФотоотчетОбязателен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКИС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Трудоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщиеВидыРемонтов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧеловек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехРешение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонтов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МатериалыКСписанию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтоматическиДобавленнаяСтрока</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаХарактеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаСерия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МатериалыКОприходованию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фотографии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтроку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УстановленныеТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Enums/ГрадацииКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ГрадацииКачества</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграниченноГоден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеГоден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Documents/мп_ЗаданиеНаРемонт/Forms/ФормаСтрокиОприходования/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИменаЭлементов = "Номенклатура, Характеристика, Серия, Склад, Количество, НоменклатураВозврат, ХарактеристикаВозврат"
		+ ", СерияВозврат, СтатусУказанияСерий, Источник, СтатусОбмена, ТолькоПросмотр, НомерСтроки, ОбъектЭксплуатации"
		+ ", ВыбранныйУзел";

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ИменаЭлементов);
	ЭтотОбъект.МатериалыКОприходованию.Загрузить(Параметры.МатериалыКОприходованию.Выгрузить());
	ЭтотОбъект.МатериалыКСписанию.Загрузить(Параметры.МатериалыКСписанию.Выгрузить());
	
	ЗаданиеНаРемонтВызовСервераЛокализация.ЗаполнитьСписокИзменяемыхВидовНоменклатуры(ЭтотОбъект);

	ДоступностьРеквизитов();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ЗначенияСтроки = Новый Структура;
	ЗначенияСтроки.Вставить("Номенклатура", ЭтотОбъект.Номенклатура);
	ЗначенияСтроки.Вставить("Характеристика", ЭтотОбъект.Характеристика);
	ЗначенияСтроки.Вставить("Серия", ЭтотОбъект.Серия);
	ЗначенияСтроки.Вставить("Склад", ЭтотОбъект.Склад);
	ЗначенияСтроки.Вставить("НоменклатураВозврат", ЭтотОбъект.НоменклатураВозврат);
	ЗначенияСтроки.Вставить("ХарактеристикаВозврат", ЭтотОбъект.ХарактеристикаВозврат);
	ЗначенияСтроки.Вставить("Количество", ЭтотОбъект.Количество);
	ЗначенияСтроки.Вставить("НомерСтроки", ЭтотОбъект.НомерСтроки);
	ЗначенияСтроки.Вставить("СохранитьИзменения", ЭтотОбъект.СохранитьИзменения);
	ОповеститьОВыборе(ЗначенияСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.мп_ЗаданиеНаРемонт.Форма.ФормаУстановленныеТМЦ" Тогда
		Если ИсточникВыбора.СохранитьИзменения Тогда
			ЭтотОбъект.Номенклатура = ИсточникВыбора.ВыбраннаяНоменклатура;
			ЭтотОбъект.Характеристика = ИсточникВыбора.ВыбраннаяХарактеристика;
			ЭтотОбъект.Серия = ИсточникВыбора.ВыбраннаяСерия;
			Если Не ЗначениеЗаполнено(ЭтотОбъект.НоменклатураВозврат) Тогда
				СписокВосстановление = СписокНоменклатурыБрак(ЭтотОбъект.Номенклатура);
				Если СписокВосстановление.Количество() = 1 Тогда
					ЭтотОбъект.НоменклатураВозврат = СписокВосстановление[0];
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(ЭтотОбъект.НоменклатураВозврат) И Не ЗначениеЗаполнено(ЭтотОбъект.ХарактеристикаВозврат) Тогда
				Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.НоменклатураВозврат);
				Если Не Характеристики = Неопределено Тогда
					ЭтотОбъект.ХарактеристикаВозврат = ЭтотОбъект.Характеристика;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) Тогда
		МассивЭлементов = Новый Массив;
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.Номенклатура);
		Если Не Характеристики = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Характеристики);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	Иначе 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) Тогда
		МассивЭлементов = Новый Массив;
		Серии = ОбщегоНазначенияВызовСервера.СерииПоНоменклатуре(ЭтотОбъект.Номенклатура);
		Если Не Серии = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Серии);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	Иначе 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерияВозвратНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ЭтотОбъект.НоменклатураВозврат) Тогда
		МассивЭлементов = Новый Массив;
		Серии = ОбщегоНазначенияВызовСервера.СерииПоНоменклатуре(ЭтотОбъект.НоменклатураВозврат);
		Если Не Серии = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Серии);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	Иначе 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Склады = ОбщегоНазначенияВызовСервера.СкладыПоКонстанте();
	Если Склады = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	МассивЭлементов = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Склады);
	МассивЭлементов.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	ПустаяНоменклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	ЭтоЗаменяемаяНоменклатура = ЗаданиеНаРемонтВызовСервераЛокализация.ЭтоИзменяемаяНоменклатура(
		ВыбранноеЗначение, ЭтотОбъект.ЗаменяемыеВидыНоменклатуры, ПустаяНоменклатура);

	Если ЭтоЗаменяемаяНоменклатура Тогда

		ВидНоменклатуры = ПредставлениеВидаНоменклатуры(ВыбранноеЗначение);
		ТекстСообщения = СтрШаблон("Номенклатуру с видом %1 нужно указывать в качестве заменяемой на закладке Материалы к списанию", ВидНоменклатуры);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		СтандартнаяОбработка = Истина;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВозвратНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СписокВосстановление = СписокНоменклатурыБрак(ЭтотОбъект.Номенклатура);

	Если СписокВосстановление.Количество() = 0 Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;

	МассивЭлементов = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", СписокВосстановление);
	МассивЭлементов.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВозвратПриИзменении(Элемент)
	ДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаВозвратНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ЭтотОбъект.НоменклатураВозврат) Тогда
		МассивЭлементов = Новый Массив;
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.НоменклатураВозврат);
		Если Не Характеристики = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Характеристики);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	Иначе 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	Если ПроверкаЗаполнения() Тогда
		ЭтотОбъект.СохранитьИзменения = Истина;
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеТМЦ(Команда)
	Данные = Новый Структура;
	Данные.Вставить("ОбъектЭксплуатации", ЭтотОбъект.ОбъектЭксплуатации);
	Данные.Вставить("ВыбранныйУзел", ЭтотОбъект.ВыбранныйУзел);
	Данные.Вставить("МатериалыКОприходованию", ЭтотОбъект.МатериалыКОприходованию);
	Данные.Вставить("МатериалыКСписанию", ЭтотОбъект.МатериалыКСписанию);
	Данные.Вставить("ЗаменяемыеВидыНоменклатуры", ЭтотОбъект.ЗаменяемыеВидыНоменклатуры);

	ОткрытьФорму("Документ.мп_ЗаданиеНаРемонт.Форма.ФормаУстановленныеТМЦ",
		Данные, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверкаЗаполнения()

	Ошибки = Неопределено;
	ДоступностьВыбораХарактеристики = Ложь;
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Номенклатура", "Укажите номенклатуру");
	Иначе
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.Номенклатура);
		ДоступностьВыбораХарактеристики = ?(Характеристики = Неопределено, Ложь, Истина);
	КонецЕсли;
	
	Если ДоступностьВыбораХарактеристики И Не ЗначениеЗаполнено(ЭтотОбъект.Характеристика) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Характеристика", "Укажите характеристику");
	КонецЕсли;

	ДоступностьСерий = ОбщегоНазначенияВызовСервера.СерииПоНоменклатуре(ЭтотОбъект.Номенклатура);
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Серия) И Не ДоступностьСерий = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Серия", "Укажите серию");
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЭтотОбъект.Склад) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Склад", "Укажите склад");
	КонецЕсли;
	
	Если ЭтотОбъект.Количество = 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Количество", "Укажите количество");
	КонецЕсли;

	Если Не Ошибки = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеВидаНоменклатуры(Знач Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(Номенклатура.ВидНоменклатуры) КАК ВидНоменклатурыПредставление
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ВидНоменклатурыПредставление;

КонецФункции

&НаСервере
Процедура ДоступностьРеквизитов()

	Если ЭтотОбъект.ТолькоПросмотр Тогда

		РазрешеноИзменять =Новый Массив;
		ЗапрещеноИзменять = Новый Массив;
		ЗапрещеноИзменять = 
			ОбщегоНазначения.ЗапрещаемыеЭлементы(Элементы, РазрешеноИзменять, ЗапрещеноИзменять);

		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
			Элементы, РазрешеноИзменять, "Доступность", Истина);

		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
			Элементы, ЗапрещеноИзменять, "Доступность", Ложь);
		Возврат;
	КонецЕсли;

	ДоступностьХарактеристики();
	ДоступностьСерий();
	ДоступностьРеквизитовБрак();

КонецПроцедуры

&НаСервере
Процедура ДоступностьХарактеристики()

	ДоступностьВыбора = Ложь;
	Если ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) Тогда
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.Номенклатура);
		ДоступностьВыбора = ?(Характеристики = Неопределено, Ложь, Истина);
	КонецЕсли;

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Характеристика", "Доступность", ДоступностьВыбора);

КонецПроцедуры

&НаСервере
Процедура ДоступностьСерий()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВыбраннаяНоменклатура", ЭтотОбъект.Номенклатура);
	Запрос.УстановитьПараметр("ВыбраннаяНоменклатураВозврат", ЭтотОбъект.НоменклатураВозврат);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА КАК ИспользоватьСерии
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|			И (ВидыНоменклатуры.ИспользоватьСерии)
	|			И (Номенклатура.Ссылка = &ВыбраннаяНоменклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА КАК ИспользоватьСерии
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|			И (Номенклатура.Ссылка = &ВыбраннаяНоменклатураВозврат)
	|			И (ВидыНоменклатуры.ИспользоватьСерии)";

	ПакетРезультатов = Запрос.ВыполнитьПакет();
	ИндексПоследнегоПакета = ПакетРезультатов.ВГраница();
	
	Результат1 = ПакетРезультатов[ИндексПоследнегоПакета - 1];
	ДоступностьСерии = Не Результат1.Пустой();
	
		
	Результат2 = ПакетРезультатов[ИндексПоследнегоПакета];
	ДоступностьЗаменаСерии = Не Результат2.Пустой();

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Серия", "Доступность", ДоступностьСерии);
		
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СерияВозврат", "Доступность", ДоступностьЗаменаСерии);

КонецПроцедуры

&НаСервере
Процедура ДоступностьРеквизитовБрак()

	СписокБрака = СписокНоменклатурыБрак(ЭтотОбъект.Номенклатура);
	ДоступностьОткрытияБрака = СписокБрака.Количество();
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НоменклатураВозврат", "Доступность", ДоступностьОткрытияБрака);
		
	ДоступностьВыбора = Ложь;
	Если ЗначениеЗаполнено(ЭтотОбъект.НоменклатураВозврат) Тогда
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.Номенклатура);
		ДоступностьВыбора = ?(Характеристики = Неопределено, Ложь, Истина);
	КонецЕсли;

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ХарактеристикаВозврат", "Доступность", ДоступностьВыбора);

КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокНоменклатурыБрак(Знач НоменклатураНовая)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыДругогоКачества.НоменклатураБрак КАК НоменклатураБрак
	|ИЗ
	|	РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТоварыДругогоКачества.Номенклатура = СпрНоменклатура.Ссылка
	|			И (НЕ ТоварыДругогоКачества.ГрадацияКачества = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.Новый))
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &НоменклатураНовая
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры = ВЫРАЗИТЬ(&НоменклатураНовая КАК Справочник.Номенклатура).ВидНоменклатуры
	|			И Номенклатура.Мечел_БУ
	|			И НЕ Номенклатура.ЭтоГруппа
	|			И НЕ Номенклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НоменклатураНовая", НоменклатураНовая);
	
	РезультатЗапроса = Запрос.Выполнить();
	НоменклатураБрак = ОбщегоНазначения.ВыгрузитьКолонку(РезультатЗапроса.Выгрузить(), "НоменклатураБрак", Истина);
	Если НоменклатураБрак.Найти(НоменклатураНовая) = Неопределено Тогда
		НоменклатураБрак.Добавить(НоменклатураНовая);
	КонецЕсли;
	Возврат НоменклатураБрак;

КонецФункции

#КонецОбласти
